app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @food = Food.find(params[:id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @food = Food.find(params[:id])

INSERT INTO "foods" ("created_at", "name", "restaurant", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 14 May 2013 07:45:05 UTC +00:00], ["name", "MyString"], ["restaurant", "MyString"], ["updated_at", Tue, 14 May 2013 07:45:05 UTC +00:00]]
---
  def create
    @food = Food.new(params[:food])

    respond_to do |format|
      if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @food = Food.find(params[:id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 980190962]]
---
  def destroy
    @food = Food.find(params[:id])
    @food.destroy